controllers/OwnerController.php

    protected function isOwner()
    {
        $user_id = Yii::$app->user->id;
        $device_id = Yii::$app->request->get('id');
        $result = Owner::find()->where(['user_id' => $user_id])->andWhere(['device_id' => $device_id])->exists();
---
SELECT EXISTS(SELECT * FROM `owners` WHERE (`user_id`=25) AND (`device_id`='108'))
SELECT 1 FROM `owners` WHERE (`user_id`=25) AND (`device_id`='108')

    public function getRevenueCash($id, $day)
    {
        $set = Events::find()->where(['device_id' => $id])->andWhere(['name'=>'Money'])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->all();
---
SELECT * FROM `events` WHERE ((`device_id`='108') AND (`name`='Money')) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getRevenueCashless($id, $day)
    {
        $set = Events::find()->where(['device_id' => $id])->andWhere(['name'=>'Cashless'])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->all();
---
SELECT * FROM `events` WHERE ((`device_id`='108') AND (`name`='Cashless')) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getStackerContent_new($id)
    {
        $set = Events::find()->where(['device_id' => $id])->andWhere(['name'=>'Money'])->andWhere(new Expression('time > (select IfNull(max(time), \'01-01-01 00:00:00\') from events where name = \'Encashment\' AND device_id = ' . $id . ')'))->all();
---
SELECT * FROM `events` WHERE ((`device_id`='108') AND (`name`='Money')) AND (time > (select IfNull(max(time), '01-01-01 00:00:00') from events where name = 'Encashment' AND device_id = 108))

    public function getActivationsWedding($id, $day)
    {
        return Events::find()->where(['device_id' => $id])->andWhere(['OR',['LIKE', 'name', 'Payment screen activated'],['LIKE', 'name', 'Wedding payment screen activated']])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->count();
---
SELECT COUNT(*) FROM `events` WHERE ((`device_id`='108') AND ((`name` LIKE '%Payment screen activated%') OR (`name` LIKE '%Wedding payment screen activated%'))) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getActivationsTalisman($id, $day)
    {
        return Events::find()->where(['device_id' => $id])->andWhere(['LIKE', 'name', 'Talisman payment screen activated'])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->count();
---
SELECT COUNT(*) FROM `events` WHERE ((`device_id`='108') AND (`name` LIKE '%Talisman payment screen activated%')) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getGamesWedding($id, $day)
    {
        return Events::find()->where(['device_id' => $id])->andWhere(['name' => 'Game'])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->count();
---
SELECT COUNT(*) FROM `events` WHERE ((`device_id`='108') AND (`name`='Game')) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getGamesTalisman($id, $day)
    {
        return Events::find()->where(['device_id' => $id])->andWhere(['name' => 'Talisman'])->andWhere(new Expression('time BETWEEN \'' . $day . '\' AND DATE_ADD(\'' . $day . '\', INTERVAL 1 DAY) '))->count();
---
SELECT COUNT(*) FROM `events` WHERE ((`device_id`='108') AND (`name`='Talisman')) AND (time BETWEEN '2018-11-06' AND DATE_ADD('2018-11-06', INTERVAL 1 DAY) )

    public function getStackerContent($id)
    {
        $set = Log::find()->where([ 'device_id' => $id ])->andWhere(['like', 'message', 'Recieved % rubles', false])->andWhere(new Expression('time > (select IfNull(max(time), \'01-01-01 00:00:00\') from logs where message = \'Stacker inserted\' AND device_id = '.$id.')'))->all();
---
SELECT * FROM `logs` WHERE ((`device_id`='108') AND (`message` LIKE 'Recieved % rubles')) AND (time > (select IfNull(max(time), '01-01-01 00:00:00') from logs where message = 'Stacker inserted' AND device_id = 108))