controllers/OwnerController.php

SELECT * FROM `config` WHERE `device_id`='108'
---
    public function actionLog($id)
    {
        $model = $this->findModel($id);
        $model->load(Yii::$app->request->post());
        $model->save();

        switch (Config::find()->where(['device_id' => $id])->one()->log_level) {