controllers/OwnerController.php

SELECT * FROM `logs` WHERE (`device_id`='108') AND (`message` LIKE 'Recieved % rubles') AND (time > (select IfNull(max(time), '01-01-01 00:00:00') from logs where message = 'Stacker inserted' AND device_id = 108))
---
    public function getStackerContent($id)
    {
        $set = Log::find()->where([ 'device_id' => $id ])->andWhere(['like', 'message', 'Recieved % rubles', false])->andWhere(new Expression('time > (select IfNull(max(time), \'01-01-01 00:00:00\') from logs where message = \'Stacker inserted\' AND device_id = '.$id.')'))->all();