models/Config.php

    public function getToner() {
        return CurrentStatus::findOne($this->device_id)->printer_media_count;
---
SELECT * FROM `current_status` WHERE `device_id`=108